var $_ = {
    init: function () {
        this.initCache();
        this.initForms();
        this.scrollToTop();
        this.animatedScroll();
        this.drawSvg();

    },
    initCache: function () {
        this.$document = $(window);
        this.$html = $('html, body');
        this.$slider = $('.js-slider-banner');
        this.$scrollToTop = $('.js-scroll-to-top');


        this.$phaseTitle = $('.js-phase-title');
        this.$table = $('.js-table');

        this.$svg = $('.js-ecg-range');
        this.$svgHeart = $('.js-svg-heart');

        this.$number = $('.js-number');
    },
    initForms: function () {
        form_adjuster.init({
            'file': false,
            'success': function () {
                var $form = $(form_adjuster.$form_cur),
                    $inputs = $form.find('input,textarea');

                if ($('.js-popup').hasClass('_active')) {
                    $('.js-popup._active').removeClass('_active');
                } else {
                    $('.js-overlay').addClass('_active');
                }

                $('.js-popup-thx').addClass('_active');


                setTimeout(function () {
                    $form.trigger('reset');
                    $inputs.removeClass('valid error active _active');


                }, 500);

                setTimeout(function () {
                    if ($('.js-popup').hasClass('_active')) {
                        $('.js-popup,.js-overlay').removeClass('_active');
                    }
                }, 4000)
            }
        });
    },

    scrollToTop: function () {

        $_.$scrollToTop.on('click', function () {

            $_.$html.animate({scrollTop: 0}, 1000);
        });
    },
    slickSlider: function () {
        $_.$slider.slick({
            arrows: true,
            dots: true
        });
    },
    animatedScroll: function () {
        $_.$document.on('scroll', function () {
            if ($(window).scrollTop() > $_.$document.innerHeight()) {
                $_.$scrollToTop.addClass('show');
            } else {
                $_.$scrollToTop.removeClass('show');
            }
        });
    },
    changePhase: function (data, ecg, heart) {
        $_.$phaseTitle.html(data.title);
        $_.$table.html(data.table);
        $_.$number.html(data.id);
        for (var i = 1; i < 10; i++) {
            ecg.select('.js-phase'.concat(i)).opacity(0);
        }
        ecg.select('.js-phase'.concat(data.phase)).opacity(1);

        heart.select('.js-sa-node').opacity(data.showSA);
        heart.select('.js-av-node').opacity(data.showAV);
        heart.select('.js-blue-heart').attr({
            "d": data.blueHeart
        });
        heart.select('.js-red-heart').attr({
            "d": data.redHeart
        });
        heart.select('.js-grey-heart').attr({
            "d": data.greyHeart
        });

        heart.select('.js-blue-blood-top').attr({
            "d": data.blueBloodTop
        });
        heart.select('.js-blue-blood-bottom').attr({
            "d": data.blueBloodBottom
        });
        heart.select('.js-red-blood').attr({
            "d": data.redBlood
        });

    },
    drawSvg: function () {
        var ecg = SVG("ecg-svg");
        var heart = SVG("svgHeart");
        var ecgPhases = [
            {
                id: 0,
                phase: 1,
                title: "Систола предсердий",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки перикардита</td><td>Увеличенная амплитуда Р волны. Возможно снижение амплитуды R зубца ниже изолинии при ортопробе</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Несколько Р волн</td></tr>",
                showSA: 1,
                showAV: 1,
                blueBloodBottom: 'M1149.52 2307.7l-133.77 -5.2 0.97 -25.11 133.77 5.2 -0.97 25.11zm44.22 5.39l-12.28 -32.98 -1.26 32.45 -69.09 -32.02 14.79 -31.92 69.09 32.01 -1.26 32.45zm0 0l1.26 -32.45 38.26 17.73 -39.52 14.72zm-77.51 10.08l-6.13 -16.48 71.37 -26.58 12.28 32.98 -71.37 26.58 -6.14 -16.49z',
                blueBloodTop: 'M1235.43 1929.49l-127.59 -115.21 16.84 -18.66 127.59 115.21 -16.84 18.66zm30.49 32.47l11.71 -33.18 -21.76 24.1 -32.52 -68.86 31.81 -15.03 32.52 68.86 -21.76 24.1zm0 0l21.76 -24.1 18.01 38.13 -39.77 -14.03zm-65.97 -41.93l5.85 -16.58 71.82 25.34 -11.71 33.18 -71.82 -25.34 5.86 -16.59z',
                redBlood: 'M2710.29 798.64l-9.99 -140.61 25.07 -1.78 9.99 140.61 -25.07 1.78zm-0.51 44.55l31.43 -15.82 -32.39 2.31 24.25 -72.18 33.35 11.2 -24.25 72.19 -32.39 2.31zm0 0l32.39 -2.31 -13.44 39.97 -18.96 -37.67zm-18.52 -75.94l15.71 -7.92 34.24 68.04 -31.43 15.82 -34.24 -68.04 15.71 -7.91z',
                redHeart: 'M962.31 204.78c20.32,-53.62 73.42,-113.82 134.6,-146.12 54.36,-28.69 62.67,-60.25 191.89,-53.56 258.6,364.67 267.03,537.13 629.21,889.93 81.15,70.88 166.93,124.39 221.94,194.77 76.4,97.74 86.14,23.16 31.92,-15.45 -109.63,-78.07 -147.55,-204.19 -160.05,-274.92 -1.96,-119.03 -1.31,-224.05 50.72,-290.71 52.66,-67.48 164.26,-113.72 244.75,-143.58 116.21,-29.33 224.1,-50.3 338.71,-32.78 78.19,11.95 140.23,42.22 194.84,41.2 24.74,-0.47 15.82,-52.05 47.95,-52.12 58.37,3.82 84.32,11.74 114.88,48.29 18.33,19.87 -18.3,43.35 0.02,63.2 14.37,15.55 102.25,51.25 138.83,71.98 68.01,64.45 87.18,104.27 97.4,190.17 1.72,14.55 4.8,100.2 2.98,115.91 -7.8,67.09 -43.64,186.54 -85.55,238.23 -81.26,28.36 -145.4,-10.5 -226.67,98.04 45.2,-22.66 98.54,-95.14 152.86,-63.08 47.42,28 138.43,103.41 184.72,150.12 97.14,98.01 181.15,186.77 243.78,280.34 86.86,129.77 142.12,195.55 217.85,377.78 33.7,128.41 48.15,129.97 43.3,301.46 -2.79,98.59 -14.34,135.19 -56.67,215.7 -87.42,113.18 -193.55,161.56 -240.96,160.02 -94.51,-3.08 -161.95,-12.72 -351.12,-89.62 -153.04,-58.95 -190.67,-104.06 -301.12,-177.68 -164.33,-109.53 -354.92,-240.14 -478.39,-366.08 19.64,-32.18 164.43,-25.03 197.15,-161.94 -45.38,64.18 -206.66,138.6 -267.48,88.31 -105.26,-106.29 -218.26,-222.27 -323.81,-319.02 -411.74,-377.42 -491.65,-425.77 -781.24,-923.38l-207.24 -415.4z',
                blueHeart: 'M908.96 1425.65c-3.28,-181.07 -12.27,-413.69 -15.54,-594.76 51.79,-37.19 116.69,-61.31 179.9,-62.48 52.37,-0.97 119.51,9.48 160.44,51.03 0,103.63 7.89,294.25 7.89,397.87 84.38,-18.88 110.89,-21.3 192.53,12.82 66.97,35.86 127.49,110.26 165.75,174.65 63.33,106.58 117.83,416.29 111.21,637.88 -2,66.79 -80.44,125.32 -82.99,169.52 -0.67,11.65 95.88,-133.68 97.7,-123.36 -1.89,-17.67 135.64,-37.51 118.67,-43.64 -20.28,-7.32 -113.75,7.84 -117.51,-22.3 -70.76,-567.43 -142.22,-1326.25 -200.38,-1871.02 20.67,-120.94 134.63,-133.88 197.84,-140.29 90.03,-6.13 173.76,24.98 216.13,110.83 56.87,608.99 126.86,1180.37 227.9,1741.9 2.17,1.86 -10.51,47.79 -36.17,78.08 -27.06,31.95 -67.21,48.39 -64.94,50.32 40.69,34.38 91.69,-87.67 137.18,-58.86 281.87,178.49 627.5,428.84 788.32,767.15 39.27,83.45 90.74,207.83 -27.06,373.1 -248.3,169.81 -535.21,131.55 -703.72,129.35 -260.71,-34.36 -529.59,-120.25 -703.59,-288.78 -107.99,-114.53 -114.36,-186.16 -198.79,-338.72 -3.79,-8.9 100.22,-175.01 93.08,-181.44 -13.12,-11.82 -67.15,103.14 -121.65,156.25 -27.23,26.54 -74.26,10.25 -86.89,20.36 -11.83,303.56 1.32,422.03 4.21,678.15 -79.97,71.88 -269.6,48.84 -355.06,9.82 -6.77,-249.07 2.82,-512.87 -3.95,-761.93 -67.83,-59.96 -120.95,-101.94 -162.58,-188.06 -47.54,-98.36 -47.55,-194.61 -29.68,-379.72 59.63,-290.49 94.66,-297.73 211.76,-503.71z',
                greyHeart: 'M1320.06 2558.86c30.83,-120.8 122.92,-209.19 229.47,-214.92 10.17,-0.54 11.17,-1.19 3.45,3.41 -75.17,44.74 -138.32,124.84 -154.8,215.72 50.24,226.18 221.44,424.77 435.62,502.64 829.37,301.59 1541.44,67.03 980.17,-536.15 -133.04,-142.97 -318.35,-318.35 -636.71,-569.68 -74.07,59.88 -154.07,47.07 -222.2,2.1 -9.79,-6.47 -9.39,-6.52 2.36,-3.86 72.75,16.45 142.98,-1.33 177.96,-48.48l-36.75 -226.73 188.82 169.62c127.21,12.52 228.94,-46.71 288.57,-132.26 0.31,-0.45 1.57,-0.61 1.36,0.66 -13.45,84.34 -78.07,158.58 -199.06,197.07 257.62,190.3 441.63,359.44 628.32,452.39 202.57,100.85 361.29,169.7 485.89,142.41 325.01,-71.23 346.07,-637.01 -134.05,-1139.31l-301.58 -284.85c-63.36,17.29 -134.09,67.42 -175.1,152.96 -0.41,0.87 -2.35,-0.58 -2.26,-1.11 12.23,-71.12 21.86,-220.12 253.62,-222.92 84.56,-200.78 141.56,-414.83 -93.01,-532.1 -546.32,-273.14 -1192.46,-67.91 -946.65,477.5 58.19,129.13 511.02,452.39 578.02,452.39 28.12,-101.78 114.74,-163.86 199.79,-168.57 1.01,-0.05 0.79,2.33 -0.2,3.02 -66.48,49.89 -140.54,95.52 -130.2,191.09 41.17,243.89 -127.9,264.86 -136.15,260.41 2.53,-11.94 222.6,-122.89 -59.36,-296.51 -101.02,-41.86 -159.74,-93.79 -216.83,-133.19 -151.52,-104.62 -216.92,-177.77 -302.1,-275.12 -24.94,-91.18 -33.34,-228.85 -36.43,-387.08 31.94,-100.08 62,-118.55 136.97,-174.21 295.53,-219.48 1105.44,-116.28 1141.54,300.78 7.93,91.49 -22.76,197.46 -102.75,319.16 1365.52,963.4 1080.68,2203.26 444,2362.43 -1155.09,288.78 -2060.85,92.15 -2287.05,-812.61 -569.66,67.02 -824.4,-389.59 -527.78,-1022.04 258.51,-551.21 949.65,-644.84 938.29,427.24 68.31,34.24 136.92,2.92 194.14,-48.47 6.6,-5.91 9.61,-6.4 4.77,1.77 -44.53,75.23 -119.77,131.32 -198.91,155.6 -54.15,37.48 -130.55,138.37 -162.7,210.61 -4.47,10.05 -6.35,7.42 -5.34,-7.48 5.44,-79.79 76.15,-201.33 134.53,-295.27 0,-209.43 -52.43,-434.28 -92.15,-561.29 -79.27,-253.54 -325.3,-303.38 -533.1,-173.3 -312.69,195.71 -541.08,989.37 -128.72,1212.12 97.44,52.63 231.87,54.43 374.27,54.43z'

            },
            {
                id: 1,
                phase: 1,
                title: "Систола предсердий",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td><tr><td>Признаки перикардита</td><td>Увеличенная амплитуда Р волны. Возможно снижение амплитуды R зубца ниже изолинии при ортопробе</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Несколько Р волн</td></td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: 'M1240.5 2311.24l-133.77 -5.2 0.97 -25.11 133.77 5.2 -0.97 25.11zm44.22 5.39l-12.28 -32.98 -1.26 32.45 -69.09 -32.02 14.79 -31.92 69.09 32.01 -1.26 32.45zm0 0l1.26 -32.45 38.26 17.73 -39.52 14.72zm-77.51 10.08l-6.13 -16.48 71.37 -26.58 12.28 32.98 -71.37 26.58 -6.14 -16.49z',
                blueBloodTop: 'M1326.04 2014.64l-127.59 -115.21 16.84 -18.66 127.59 115.21 -16.84 18.66zm30.49 32.47l11.71 -33.18 -21.76 24.1 -32.52 -68.86 31.81 -15.03 32.52 68.86 -21.76 24.1zm0 0l21.76 -24.1 18.01 38.13 -39.77 -14.03zm-65.97 -41.93l5.85 -16.58 71.82 25.34 -11.71 33.18 -71.82 -25.34 5.86 -16.59z',
                redBlood: 'M2728.13 912.61l-9.99 -140.61 25.07 -1.78 9.99 140.61 -25.07 1.78zm-0.51 44.55l31.43 -15.82 -32.39 2.31 24.25 -72.18 33.35 11.2 -24.25 72.19 -32.39 2.31zm0 0l32.39 -2.31 -13.44 39.97 -18.96 -37.67zm-18.52 -75.94l15.71 -7.92 34.24 68.04 -31.43 15.82 -34.24 -68.04 15.71 -7.91z',
                redHeart: 'M962.31 204.78c20.32,-53.62 73.42,-113.82 134.6,-146.12 54.36,-28.69 62.67,-60.25 191.89,-53.56 258.6,364.67 267.03,537.13 629.21,889.93 81.15,70.88 166.93,124.39 221.94,194.77 76.4,97.74 86.14,23.16 31.92,-15.45 -109.63,-78.07 -147.55,-204.19 -160.05,-274.92 -1.96,-119.03 -1.3,-224.05 50.72,-290.71 52.66,-67.47 160.16,-121.9 240.66,-151.76 59.76,-40.78 238.89,-78.93 353.47,-61.44 78.16,11.93 161.12,20.79 204.67,41.47 22.33,10.6 -4.67,-15.48 27.46,-15.55 58.37,3.82 84.32,11.74 114.88,48.29 18.33,19.87 0.51,20.45 18.83,40.29 14.36,15.55 91.62,57.79 120.02,94.89 68.01,64.45 87.18,104.27 97.4,190.17 1.72,14.55 4.8,100.2 2.98,115.91 -7.8,67.09 -43.64,186.54 -85.55,238.23 -81.26,28.36 -113.5,-20.31 -194.77,88.22 45.2,-22.66 66.65,-85.32 120.96,-53.26 47.42,27.99 138.43,103.41 184.72,150.12 97.14,98.01 181.15,186.77 243.78,280.34 86.86,129.77 142.12,195.55 217.85,377.78 33.7,128.41 48.15,129.97 43.3,301.46 -2.79,98.59 -14.34,135.19 -56.67,215.7 -87.42,113.18 -193.55,161.56 -240.96,160.02 -94.51,-3.08 -161.95,-12.72 -351.12,-89.62 -153.04,-58.95 -190.67,-104.06 -301.12,-177.68 -164.33,-109.53 -354.92,-240.14 -478.39,-366.08 19.64,-32.18 164.43,-25.03 197.15,-161.94 -45.38,64.18 -206.66,138.6 -267.48,88.31 -105.26,-106.29 -218.26,-222.27 -323.81,-319.02 -411.74,-377.42 -491.65,-425.77 -781.24,-923.38l-207.24 -415.4z',
                blueHeart: 'M907.85 1371.54c-3.28,-181.07 -11.16,-359.58 -14.44,-540.65 51.79,-37.19 116.69,-61.31 179.9,-62.48 52.37,-0.97 119.51,9.48 160.44,51.03 0,103.63 7.89,294.25 7.89,397.87 84.38,-18.88 110.89,-21.3 192.53,12.82 66.97,35.86 127.49,110.26 165.75,174.65 63.33,106.58 117.83,416.29 111.21,637.88 -2,66.79 -80.44,125.32 -82.99,169.52 -0.67,11.65 95.88,-133.68 97.7,-123.36 -1.89,-17.67 135.64,-37.51 118.67,-43.64 -20.28,-7.32 -113.75,7.84 -117.51,-22.3 -70.76,-567.43 -142.22,-1326.25 -200.38,-1871.02 20.67,-120.94 134.63,-133.88 197.84,-140.29 90.03,-6.13 173.76,24.98 216.13,110.83 56.87,608.99 126.86,1180.37 227.9,1741.9 2.17,1.86 -10.51,47.79 -36.17,78.08 -27.06,31.95 -67.21,48.39 -64.94,50.32 40.69,34.38 91.69,-87.67 137.18,-58.86 281.87,178.49 627.5,428.84 788.32,767.15 39.27,83.45 90.74,207.83 -27.06,373.1 -248.3,169.81 -535.21,131.55 -703.72,129.35 -260.71,-34.36 -529.59,-120.25 -703.59,-288.78 -107.99,-114.53 -114.36,-186.16 -198.79,-338.72 -3.79,-8.9 88.35,-125.11 81.21,-131.53 -13.11,-11.81 -52.43,67.15 -106.92,120.25 -27.22,26.53 -77.13,-3.66 -89.76,6.45 -11.83,303.56 1.32,422.03 4.21,678.15 -79.97,71.88 -269.6,48.84 -355.06,9.82 -6.77,-249.07 2.82,-512.87 -3.95,-761.93 -67.83,-59.96 -120.96,-101.94 -162.58,-188.06 -47.54,-98.35 -55.74,-246.97 -37.87,-432.08 59.63,-290.49 101.74,-299.48 218.84,-505.47z',
                greyHeart: 'M1320.06 2558.86c30.83,-120.8 169.14,-181.8 257.71,-162.16 9.9,2.2 12.03,5.81 3.43,8.34 -80.65,23.67 -166.55,67.15 -183.03,158.04 50.24,226.18 221.44,424.77 435.62,502.64 829.37,301.59 1541.44,67.03 980.17,-536.15 -133.04,-142.97 -318.35,-318.35 -636.71,-569.68 -74.07,59.88 -154.07,47.07 -222.2,2.1 -9.79,-6.47 -9.39,-6.52 2.36,-3.86 72.75,16.45 142.98,-1.33 177.96,-48.48l-36.75 -226.73 188.82 169.62c127.21,12.52 228.94,-46.71 288.57,-132.26 0.31,-0.45 1.57,-0.61 1.36,0.66 -13.45,84.34 -78.07,158.58 -199.06,197.07 257.62,190.3 441.63,359.44 628.32,452.39 202.57,100.85 361.29,169.7 485.89,142.41 325.01,-71.23 346.07,-637.01 -134.05,-1139.31l-301.58 -284.85c-63.36,17.29 -99.46,71.27 -110.09,182.16 -0.1,0.92 -5.22,-4.35 -5.13,-4.91 -25.39,-97.28 -40.29,-245.51 191.47,-248.31 33.07,-32.52 63.35,-93.36 81.48,-155.3 36.34,-124.01 24.24,-276.98 -110.67,-388.25 -465.64,-384.07 -1298.41,-93.02 -1010.47,488.95 62.79,126.94 511.02,452.39 578.02,452.39 28.12,-101.78 159.27,-160.3 227.94,-102.83 0.74,0.62 1.68,4.1 0.69,4.79 -90.81,-14.54 -169.58,28.01 -159.24,123.58 41.17,243.89 -127.9,264.86 -136.15,260.41 2.53,-11.94 222.6,-122.89 -59.36,-296.51 -101.02,-41.86 -159.74,-93.79 -216.83,-133.19 -151.52,-104.62 -216.92,-177.77 -302.1,-275.12 -24.94,-91.18 -33.34,-228.85 -36.43,-387.08 31.94,-100.08 69.25,-109.93 136.97,-174.21 301.61,-286.35 1112.44,-193.39 1141.54,300.78 5.4,91.66 -22.76,197.46 -102.75,319.16 1365.52,963.4 1080.68,2203.26 444,2362.43 -1155.09,288.78 -2060.85,92.15 -2287.05,-812.61 -569.66,67.02 -860.38,-412.51 -563.78,-1044.95 258.52,-551.2 985.66,-621.93 974.29,450.14 68.31,34.24 136.92,2.92 194.14,-48.47 6.6,-5.91 9.61,-6.4 4.77,1.77 -44.53,75.23 -119.77,131.32 -198.91,155.6 -54.15,37.48 -109.72,88.04 -109.52,219.19 0.02,10.94 -4.82,12.79 -8.18,-1.73 -35.93,-154.24 25.82,-215.65 84.19,-309.6 0,-209.43 -19.76,-405.18 -92.15,-561.29 -111.75,-240.99 -297.15,-314.69 -520.02,-212.57 -349.06,159.94 -589.41,1001.43 -160.77,1240.16 96.75,53.89 250.84,65.65 393.24,65.65z'
            },
            {
                id: 2,
                phase: 1,
                title: "Систола предсердий",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки перикардита</td><td>Увеличенная амплитуда Р волны. Возможно снижение амплитуды R зубца ниже изолинии при ортопробе</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Несколько Р волн</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 3,
                phase: 1,
                title: "Систола предсердий",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки перикардита</td><td>Увеличенная амплитуда Р волны. Возможно снижение амплитуды R зубца ниже изолинии при ортопробе</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Несколько Р волн</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 4,
                phase: 2,
                title: "Закрытие предсердно-желудочковых клапанов",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки эндокардита</td><td>Изменение амплитуды Р-Q фазы при ортопробе</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Удлинение фазы Р-Q</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 5,
                phase: 2,
                title: "Закрытие предсердно-желудочковых клапанов",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки эндокардита</td><td>Изменение амплитуды Р-Q фазы при ортопробе</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Удлинение фазы Р-Q</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 6,
                phase: 3,
                title: "Сокращение межжелудочковой перегородки",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Врождённые фистулы</td><td>Раздвоение R зубца или реверс сокращения МЖП и малая амплитуда S зубца</td></tr><tr><td>Признаки возможной внезапной сердечной смерти</td><td>Экстрасистолия с амплитудой R зубца более чем в 2 или 3 раза</td></tr><tr><td>Митохондриальная кардиомиопатия (изменение водного обмена)</td><td>При ортопробе изменение амплитуды R зубца</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 7,
                phase: 3,
                title: "Сокращение межжелудочковой перегородки",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки возможной внезапной сердечной смерти</td><td>Экстрасистолия с амплитудой R зубца более чем в 2 или 3 раза</td></tr><tr><td>Митохондриальная кардиомиопатия (изменение водного обмена)</td><td>При ортопробе изменение амплитуды R зубца</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 8,
                phase: 4,
                title: "Сокращение стенок желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Врождённые фистулы</td><td>Раздвоение R зубца или реверс сокращения МЖП и малая амплитуда S зубца</td></tr><tr><td>Признаки возможной внезапной сердечной смерти</td><td>Экстрасистолия с амплитудой R зубца более чем в 2 или 3 раза</td></tr><tr><td>Митохондриальная кардиомиопатия (изменение водного обмена)</td><td>При ортопробе изменение амплитуды R зубца</td></tr><tr><td>Неотложное состояние</td><td>Низкое содержание кислорода, лактата, креатин-фосфата</td></tr><tr><td>Признаки недостаточности функции клапанов сердца (аорты)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (лёгочной артерии)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (предсердно-желудочковый клапан)</td><td>Ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 9,
                phase: 4,
                title: "Сокращение стенок желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Врождённые фистулы</td><td>Раздвоение R зубца или реверс сокращения МЖП и малая амплитуда S зубца</td></tr><tr><td>Признаки возможной внезапной сердечной смерти</td><td>Экстрасистолия с амплитудой R зубца более чем в 2 или 3 раза</td></tr><tr><td>Митохондриальная кардиомиопатия (изменение водного обмена)</td><td>При ортопробе изменение амплитуды R зубца</td></tr><tr><td>Неотложное состояние</td><td>Низкое содержание кислорода, лактата, креатин-фосфата</td></tr><tr><td>Признаки недостаточности функции клапанов сердца (аорты)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (лёгочной артерии)</td><td>Ограничение двигательной активности</td></tr><tr><td>Признаки недостаточности функции клапанов сердца (предсердно-желудочковый клапан)</td><td>Ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 10,
                phase: 5,
                title: "Напряжение мышц сердца",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Смещение на ЭКГ постоянной составляющей фазы S–L до уровня амплитуды R зубца</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>«Ступенька» на переднем фронте РЕОграммы</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Высокий уровень лактата</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Низкий уровень лактата</td></tr><tr><td>Снижение Ca<sup>++</sup> в мышцах сердца</td><td>Сглаживание волны SL. На РЕО слабо растёт АД</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Неотложное состояние</td><td>Низкое содержание кислорода, лактата, креатин-фосфата</td></tr><tr><td>Признаки недостаточности функции клапанов сердца (аорты)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (лёгочной артерии)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (предсердно-желудочковый клапан)</td><td>Ограничение двигательной активности</td></tr>       <tr><td>Состояние аорты</td><td>Расширение с увеличением диастолического АД</td></tr>   ",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 11,
                phase: 5,
                title: "Напряжение мышц сердца",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Смещение на ЭКГ постоянной составляющей фазы S–L до уровня амплитуды R зубца</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>«Ступенька» на переднем фронте РЕОграммы</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Высокий уровень лактата</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>Низкий уровень лактата</td></tr><tr><td>Снижение Ca<sup>++</sup> в мышцах сердца</td><td>Сглаживание волны SL. На РЕО слабо растёт АД</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Неотложное состояние</td><td>Низкое содержание кислорода, лактата, креатин-фосфата</td></tr><tr><td>Признаки недостаточности функции клапанов сердца (аорты)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (лёгочной артерии)</td><td>Ограничение двигательной активности</td></tr>  <tr><td>Признаки недостаточности функции клапанов сердца (предсердно-желудочковый клапан)</td><td>Ограничение двигательной активности</td></tr><tr><td>Состояние аорты</td><td>Расширение с увеличением диастолического АД</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 12,
                phase: 6,
                title: "Открытие клапанов и быстрое изгнание крови",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>«Ступенька» на переднем фронте РЕОграммы</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Неотложное состояние</td><td>Низкое содержание кислорода, лактата, креатин-фосфата</td></tr><tr><td>Состояние аорты</td><td>Расширение без увеличения диастолического АД</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 13,
                phase: 6,
                title: "Открытие клапанов и быстрое изгнание крови",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>«Ступенька» на переднем фронте РЕОграммы</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Неотложное состояние</td><td>Низкое содержание кислорода, лактата, креатин-фосфата</td></tr><tr><td>Расширение без увеличения диастолического АД</td><td>Снижение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0
            },
            {
                id: 14,
                phase: 7,
                title: "Медленное изгнание крови",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Кальциноз дуги аорты</td><td>На графике РЕО сглаживание вершины</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 15,
                phase: 7,
                title: "Медленное изгнание крови",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Кальциноз дуги аорты</td><td>На графике РЕО сглаживание вершины</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 16,
                phase: 8,
                title: "Создание максимального систолического давления в аорте",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Кальциноз дуги аорты</td><td>На графике РЕО сглаживание вершины</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 17,
                phase: 8,
                title: "Создание максимального систолического давления в аорте",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Кальциноз дуги аорты</td><td>На графике РЕО сглаживание вершины</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 18,
                phase: 8,
                title: "Создание максимального систолического давления в аорте",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Кальциноз дуги аорты</td><td>На графике РЕО сглаживание вершины</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 19,
                phase: 8,
                title: "Создание максимального систолического давления в аорте",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Кальциноз дуги аорты</td><td>На графике РЕО сглаживание вершины</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 20,
                phase: 9,
                title: "Закрытие полулунных клапанов",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>В фазе Т-U график РЕО имеет пологий участок или положительный подъём, указывающие на меньшее поступление количества крови в коронарные артерии в отведенное для заполнения время</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 21,
                phase: 9,
                title: "Закрытие полулунных клапанов",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Снижение кровенаполнения коронарных артерий</td><td>В фазе Т-U график РЕО имеет пологий участок или положительный подъём, указывающие на меньшее поступление количества крови в коронарные артерии в отведенное для заполнения время</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 22,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 23,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 24,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 25,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 26,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 27,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 28,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 29,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 30,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 31,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            },
            {
                id: 31,
                phase: 9,
                title: "Ранняя диастола желудочков",
                path: "",
                table: "<tr><td class='table__head'>Выявляемые физиологические, функциональные, метаболические и другие изменения</td><td class='table__head'>ЭКГ признаки</td></tr><tr><td>Признаки тромбообразования</td><td>Три вершины на РЕО</td></tr><tr><td>Изменение венозного кровотока</td><td>Нет спада РЕО в фазе T-P</td></tr><tr><td>Экстрасистолия (Дыхательная)</td><td>Зависит от частоты проявления</td></tr>  <tr><td>Экстрасистолия (Работа анастомозов)</td><td>Проблемы периферического кровообращения</td></tr>  <tr><td>Экстрасистолия (Фибробласты)</td><td>Ухудшение общего состояния, ограничение двигательной активности</td></tr>",
                showSA: 0,
                showAV: 0,
                blueBloodBottom: '',
                blueBloodTop: '',
                redBlood: '',
                redHeart: '',
                blueHeart: '',
                greyHeart: ''
            }
        ];

        $_.$svg.ionRangeSlider({
            skin: "round",
            values: [
                "Pн – Pк", "Pн – Pк", "Pн – Pк", "Pн – Pк",
                "Pк – Q", "Pк – Q",
                "Q – R", "Q – R",
                "R – S", "R – S",
                "S – L", "S – L",
                "L – j", "L – j",
                "j – Tн", "j – Tн",
                "Тн – Тк", "Тн – Тк", "Тн – Тк", "Тн – Тк",
                "Тк – Uн", "Тк – Uн",
                "Uн – Uк", "Uн – Uк", "Uн – Uк", "Uн – Uк",
                "Uк – Pн", "Uк – Pн", "Uк – Pн", "Uк – Pн", "Uк – Pн", "Uк – Pн", "Uк – Pн"
            ],
            from: 0,
            min: 0,
            max: 32,
            hide_min_max: true,
            onStart: function () {
                $_.changePhase(ecgPhases[0], ecg, heart);
            },

            onChange: function (data) {
                $_.changePhase(ecgPhases[data.from], ecg, heart);
                ecg.select('.js-green-line').attr({
                    "x1": data.from * 590 + 757,
                    "x2": data.from * 590 + 757
                });

            }
        });
    }
};


$(document).ready(function () {
    $_.init();
});

